# Gözlem Ve Değişken Seçimi

In [1]:
import numpy as np
import pandas as pd

In [2]:
m = np.random.randint(1, 30, size=(10,3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    20    20    24
1    23     8    15
2     8    25     9
3    28    28     8
4    14     7    14
5     5     7    29
6    11     5    20
7    18    28    18
8     5    22    11
9     2     5    20

In [3]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [4]:
df.loc[0:3]

   var1  var2  var3
0    20    20    24
1    23     8    15
2     8    25     9
3    28    28     8

In [5]:
#iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [6]:
df.iloc[0:3]

   var1  var2  var3
0    20    20    24
1    23     8    15
2     8    25     9

In [7]:
df

   var1  var2  var3
0    20    20    24
1    23     8    15
2     8    25     9
3    28    28     8
4    14     7    14
5     5     7    29
6    11     5    20
7    18    28    18
8     5    22    11
9     2     5    20

In [8]:
df.loc[0:3, "var1"]

0    20
1    23
2     8
3    28
Name: var1, dtype: int32

In [9]:
df.loc[1:5]

   var1  var2  var3
1    23     8    15
2     8    25     9
3    28    28     8
4    14     7    14
5     5     7    29

In [10]:
df.iloc[::-1]

   var1  var2  var3
9     2     5    20
8     5    22    11
7    18    28    18
6    11     5    20
5     5     7    29
4    14     7    14
3    28    28     8
2     8    25     9
1    23     8    15
0    20    20    24

In [11]:
df

   var1  var2  var3
0    20    20    24
1    23     8    15
2     8    25     9
3    28    28     8
4    14     7    14
5     5     7    29
6    11     5    20
7    18    28    18
8     5    22    11
9     2     5    20

In [12]:
df.iloc[0,0]

20

In [13]:
df.loc[0,"var1"]

20

In [14]:
# iloc methodu, normalde kullandığımız indeksleme mantığı ile çalışıyor.

In [15]:
df.iloc[1:3]["var2"]

1     8
2    25
Name: var2, dtype: int32

In [16]:
df.iloc[0:3, 0:2]

   var1  var2
0    20    20
1    23     8
2     8    25

In [17]:
df.loc[0:3, "var1":"var3"]

   var1  var2  var3
0    20    20    24
1    23     8    15
2     8    25     9
3    28    28     8

In [18]:
df[0:2][["var1", "var2"]]

   var1  var2
0    20    20
1    23     8

In [19]:
df.var1

0    20
1    23
2     8
3    28
4    14
5     5
6    11
7    18
8     5
9     2
Name: var1, dtype: int32

In [20]:
df[df.var1 > 15]

   var1  var2  var3
0    20    20    24
1    23     8    15
3    28    28     8
7    18    28    18

In [21]:
df[df.var1 > 15]["var1"]

0    20
1    23
3    28
7    18
Name: var1, dtype: int32

In [22]:
df[(df.var1 > 15) & (df.var3 < 15)]

   var1  var2  var3
3    28    28     8

In [23]:
df[(df.var1 > 15) & (df.var3 < 5)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [24]:
df[(df.var1 > 15) & (df.var3 < 5)]["var2"]

Series([], Name: var2, dtype: int32)

In [25]:
df[(df.var2 < 10) & (df.var3 <  10)]["var1"]

Series([], Name: var1, dtype: int32)

In [26]:
df[df.var1 < 10 ]

   var1  var2  var3
2     8    25     9
5     5     7    29
8     5    22    11
9     2     5    20

In [27]:
liste = [1, 2, 3, 4, 5]
liste

[1, 2, 3, 4, 5]

In [28]:
npp = pd.DataFrame(liste, columns=["kolon1"], index=["index1", "index2", "index3", "index4", "index5"])
npp

        kolon1
index1       1
index2       2
index3       3
index4       4
index5       5

In [29]:
npp.loc["index1":"index3"]

        kolon1
index1       1
index2       2
index3       3

In [30]:
npp.iloc[1:3]

        kolon1
index2       2
index3       3

In [31]:
npp

        kolon1
index1       1
index2       2
index3       3
index4       4
index5       5

In [32]:
npp[1:3]

        kolon1
index2       2
index3       3

In [33]:
#help(npp.iloc())

In [34]:
nop = pd.DataFrame(np.random.randint(1, 30, size=(3,3)), columns=["columns1", "columns2", "columns3"], index=["index1", "index2", "index3"])
nop

        columns1  columns2  columns3
index1        21        29        11
index2        21         7        13
index3         6         5        18

In [35]:
nop.iloc[1:3, 1:2]

        columns2
index2         7
index3         5

In [36]:
nop.iloc[:, 1:3]

        columns2  columns3
index1        29        11
index2         7        13
index3         5        18

In [37]:
nop[["columns1"]]

        columns1
index1        21
index2        21
index3         6

In [38]:
nop[["columns1","columns2","columns3"]]

        columns1  columns2  columns3
index1        21        29        11
index2        21         7        13
index3         6         5        18

In [39]:
nop[nop > 5]

        columns1  columns2  columns3
index1        21      29.0        11
index2        21       7.0        13
index3         6       NaN        18

In [40]:
nop < 5

        columns1  columns2  columns3
index1     False     False     False
index2     False     False     False
index3     False     False     False

In [43]:
dict1 = {
    "cars": ["bmw", "merdeces", "mclaren"],
    "price": ["500.000", "300.000", "1.000.000"]
}
dict1

{'cars': ['bmw', 'merdeces', 'mclaren'],
 'price': ['500.000', '300.000', '1.000.000']}

In [45]:
df1 = pd.DataFrame(dict1, index=["index1", "index2", "index3"])
df1

            cars      price
index1       bmw    500.000
index2  merdeces    300.000
index3   mclaren  1.000.000

In [46]:
?df1

Type:        DataFrame
String form:
            cars      price
index1       bmw    500.000
index2  merdeces    300.000
index3   mclaren  1.000.000
Length:      3
File:        c:\users\murat\anaconda3\lib\site-packages\pandas\core\frame.py
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index.

    .. versionchanged:: 0.25.0
       If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3

In [50]:
df1["cars"]

index1         bmw
index2    merdeces
index3     mclaren
Name: cars, dtype: object

In [55]:
df1.iloc[0]

cars         bmw
price    500.000
Name: index1, dtype: object

In [56]:
df1.loc["index1"]

cars         bmw
price    500.000
Name: index1, dtype: object

In [57]:
df1.iloc[0:2]

            cars    price
index1       bmw  500.000
index2  merdeces  300.000

In [58]:
array1 = np.random.randint(1, 100, size=(4,4))
array1

array([[48, 91, 69, 37],
       [67, 36, 52, 55],
       [35, 25, 42, 35],
       [44, 19, 37, 19]])

In [63]:
df2 = pd.DataFrame(array1, index=["indx1", "indx2", "indx3", "indx4"], columns=["cln1", "cln2", "cln3", "cln4"])
df2

       cln1  cln2  cln3  cln4
indx1    48    91    69    37
indx2    67    36    52    55
indx3    35    25    42    35
indx4    44    19    37    19

In [70]:
df2.iloc[0:2, 1]

indx1    91
indx2    36
Name: cln2, dtype: int32

In [78]:
df2["indx1":"indx2"]

       cln1  cln2  cln3  cln4
indx1    48    91    69    37
indx2    67    36    52    55

In [82]:
df2.loc["indx1":"indx2", "cln1":"cln2"]

       cln1  cln2
indx1    48    91
indx2    67    36

In [83]:
?df2.loc

Type:        property
String form: <property object at 0x0000025DAF82F360>
Docstring:
Access a group of rows and columns by label(s) or a boolean array.

``.loc[]`` is primarily label based, but may also be used with a
boolean array.

Allowed inputs are:

- A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
  interpreted as a *label* of the index, and **never** as an
  integer position along the index).
- A list or array of labels, e.g. ``['a', 'b', 'c']``.
- A slice object with labels, e.g. ``'a':'f'``.

  .. warning:: Note that contrary to usual python slices, **both** the
      start and the stop are included

- A boolean array of the same length as the axis being sliced,
  e.g. ``[True, False, True]``.
- An alignable boolean Series. The index of the key will be aligned before
  masking.
- An alignable Index. The Index of the returned selection will be the input.
- A ``callable`` function with one argument (the calling Series or
  DataFrame) and that returns valid output for indexing (one of the above)

See more at :ref:`Selection by Label <indexing.label>`.

Raises
------
KeyError
    If any items are not found.
IndexingError
    If an indexed key is passed and its index is unalignable to the frame index.

See Also
--------
DataFrame.at : Access a single value for a row/column label pair.
DataFrame.iloc : Access group of rows and columns by integer position(s).
DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
    Series/DataFrame.
Series.loc : Access group of values using labels.

Examples
--------
**Getting values**

>>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
...      index=['cobra', 'viper', 'sidewinder'],
...      columns=['max_speed', 'shield'])
>>> df
            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

Single label. Note this returns the row as a Series.

>>> df.loc['viper']
max_speed    4
shield       5
Name: viper, dtype: int64

List of labels. Note using ``[[]]`` returns a DataFrame.

>>> df.loc[['viper', 'sidewinder']]
            max_speed  shield
viper               4       5
sidewinder          7       8

Single label for row and column

>>> df.loc['cobra', 'shield']
2

Slice with labels for row and single label for column. As mentioned
above, note that both the start and stop of the slice are included.

>>> df.loc['cobra':'viper', 'max_speed']
cobra    1
viper    4
Name: max_speed, dtype: int64

Boolean list with the same length as the row axis

>>> df.loc[[False, False, True]]
            max_speed  shield
sidewinder          7       8

Alignable boolean Series:

>>> df.loc[pd.Series([False, True, False],
...        index=['viper', 'sidewinder', 'cobra'])]
            max_speed  shield
sidewinder          7       8

Index (same behavior as ``df.reindex``)

>>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
       max_speed  shield
foo
cobra          1       2
viper          4       5

Conditional that returns a boolean Series

>>> df.loc[df['shield'] > 6]
            max_speed  shield
sidewinder          7       8

Conditional that returns a boolean Series with column labels specified

>>> df.loc[df['shield'] > 6, ['max_speed']]
            max_speed
sidewinder          7

Callable that returns a boolean Series

>>> df.loc[lambda df: df['shield'] == 8]
            max_speed  shield
sidewinder          7       8

**Setting values**

Set value for all items matching the list of labels

>>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
>>> df
            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50

Set value for an entire row

>>> df.loc['cobra'] = 10
>>> df
            max_speed  shield
cobra              10      10
viper               4      50
sidewinder          7      50

Set value for an entire column

>>> df.loc[:, 'max_speed'] = 30
>>> df
            max_speed  shield
cobra              30      10
viper              30      50
sidewinder         30      50

Set value for rows matching callable condition

>>> df.loc[df['shield'] > 35] = 0
>>> df
            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0

**Getting values on a DataFrame with an index that has integer labels**

Another example using integers for the index

>>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
...      index=[7, 8, 9], columns=['max_speed', 'shield'])
>>> df
   max_speed  shield
7          1       2
8          4       5
9          7       8

Slice with integer labels for rows. As mentioned above, note that both
the start and stop of the slice are included.

>>> df.loc[7:9]
   max_speed  shield
7          1       2
8          4       5
9          7       8

**Getting values with a MultiIndex**

A number of examples using a DataFrame with a MultiIndex

>>> tuples = [
...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
...    ('viper', 'mark ii'), ('viper', 'mark iii')
... ]
>>> index = pd.MultiIndex.from_tuples(tuples)
>>> values = [[12, 2], [0, 4], [10, 20],
...         [1, 4], [7, 1], [16, 36]]
>>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
>>> df
                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

Single label. Note this returns a DataFrame with a single index.

>>> df.loc['cobra']
         max_speed  shield
mark i          12       2
mark ii          0       4

Single index tuple. Note this returns a Series.

>>> df.loc[('cobra', 'mark ii')]
max_speed    0
shield       4
Name: (cobra, mark ii), dtype: int64

Single label for row and column. Similar to passing in a tuple, this
returns a Series.

>>> df.loc['cobra', 'mark i']
max_speed    12
shield        2
Name: (cobra, mark i), dtype: int64

Single tuple. Note using ``[[]]`` returns a DataFrame.

>>> df.loc[[('cobra', 'mark ii')]]
               max_speed  shield
cobra mark ii          0       4

Single tuple for the index with a single label for the column

>>> df.loc[('cobra', 'mark i'), 'shield']
2

Slice from index tuple to single label

>>> df.loc[('cobra', 'mark i'):'viper']
                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

Slice from index tuple to index tuple

>>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                    max_speed  shield
cobra      mark i          12       2
           mark ii          0       4
sidewinder mark i          10      20
           mark ii          1       4
viper      mark ii          7       1

In [87]:
df2.loc[["indx1","indx2"]] # index listesinden tekli index çağırmak için çift parantez

       cln1  cln2  cln3  cln4
indx1    48    91    69    37
indx2    67    36    52    55

In [88]:
df2.loc["indx1":"indx3"] # slicing ile index çağırmak için tek parantez

       cln1  cln2  cln3  cln4
indx1    48    91    69    37
indx2    67    36    52    55
indx3    35    25    42    35

In [91]:
df2.loc["indx1":"indx3", ["cln1","cln2"]]

       cln1  cln2
indx1    48    91
indx2    67    36
indx3    35    25

In [92]:
df2.loc[["indx1", "indx3"], :]

       cln1  cln2  cln3  cln4
indx1    48    91    69    37
indx3    35    25    42    35

In [94]:
df2.loc[["indx1", "indx3"], "cln1":"cln2"]

       cln1  cln2
indx1    48    91
indx3    35    25

In [96]:
copy1 = df2.loc[["indx1", "indx3"], "cln1":"cln2"].copy()

In [97]:
copy1

       cln1  cln2
indx1    48    91
indx3    35    25

In [98]:
copy1.index = ["deneme1", "deneme2"]

In [99]:
copy1

         cln1  cln2
deneme1    48    91
deneme2    35    25

In [100]:
df2

       cln1  cln2  cln3  cln4
indx1    48    91    69    37
indx2    67    36    52    55
indx3    35    25    42    35
indx4    44    19    37    19